ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ST/STM32U3xx/stm32u385xx.h
/********************  Bit definition for PWR_PDCRH register  *****************/
#define PWR_PDCRH_PD0_Pos                   (0UL)
#define PWR_PDCRH_PD0_Msk                   (0x1UL << PWR_PDCRH_PD0_Pos)            /*!< 0x00000001 */
#define PWR_PDCRH_PD0                       PWR_PDCRH_PD0_Msk                       /*!< Apply pull-down for PH0  */
#define PWR_PDCRH_PD1_Pos                   (1UL)
#define PWR_PDCRH_PD1_Msk                   (0x1UL << PWR_PDCRH_PD1_Pos)            /*!< 0x00000002 */
#define PWR_PDCRH_PD1                       PWR_PDCRH_PD1_Msk                       /*!< Apply pull-down for PH1  */
#define PWR_PDCRH_PD3_Pos                   (3UL)
#define PWR_PDCRH_PD3_Msk                   (0x1UL << PWR_PDCRH_PD3_Pos)            /*!< 0x00000008 */
#define PWR_PDCRH_PD3                       PWR_PDCRH_PD3_Msk                       /*!< Apply pull-down for PH3  */

/********************  Bit definition for PWR_I3CPUCR1 register  *****************/
#define PWR_I3CPUCR1_PA1_I3CPU_Pos          (0UL)
#define PWR_I3CPUCR1_PA1_I3CPU_Msk          (0x1UL << PWR_I3CPUCR1_PA1_I3CPU_Pos)   /*!< 0x00000001 */
#define PWR_I3CPUCR1_PA1_I3CPU              PWR_I3CPUCR1_PA1_I3CPU_Msk              /*!< Port A pin 1 I3C pull-up  */
#define PWR_I3CPUCR1_PA6_I3CPU_Pos          (1UL)
#define PWR_I3CPUCR1_PA6_I3CPU_Msk          (0x1UL << PWR_I3CPUCR1_PA6_I3CPU_Pos)   /*!< 0x00000002 */
#define PWR_I3CPUCR1_PA6_I3CPU              PWR_I3CPUCR1_PA6_I3CPU_Msk              /*!< Port A pin 6 I3C pull-up  */
#define PWR_I3CPUCR1_PA7_I3CPU_Pos          (2UL)
#define PWR_I3CPUCR1_PA7_I3CPU_Msk          (0x1UL << PWR_I3CPUCR1_PA7_I3CPU_Pos)   /*!< 0x00000004 */
#define PWR_I3CPUCR1_PA7_I3CPU              PWR_I3CPUCR1_PA7_I3CPU_Msk              /*!< Port A pin 7 I3C pull-up  */
#define PWR_I3CPUCR1_PB2_I3CPU_Pos          (4UL)
#define PWR_I3CPUCR1_PB2_I3CPU_Msk          (0x1UL << PWR_I3CPUCR1_PB2_I3CPU_Pos)   /*!< 0x00000010 */
#define PWR_I3CPUCR1_PB2_I3CPU              PWR_I3CPUCR1_PB2_I3CPU_Msk              /*!< Port B pin 2 I3C pull-up  */
#define PWR_I3CPUCR1_PB6_I3CPU_Pos          (5UL)
#define PWR_I3CPUCR1_PB6_I3CPU_Msk          (0x1UL << PWR_I3CPUCR1_PB6_I3CPU_Pos)   /*!< 0x00000020 */
#define PWR_I3CPUCR1_PB6_I3CPU              PWR_I3CPUCR1_PB6_I3CPU_Msk              /*!< Port B pin 6 I3C pull-up  */
#define PWR_I3CPUCR1_PB8_I3CPU_Pos          (6UL)
#define PWR_I3CPUCR1_PB8_I3CPU_Msk          (0x1UL << PWR_I3CPUCR1_PB8_I3CPU_Pos)   /*!< 0x00000040 */
#define PWR_I3CPUCR1_PB8_I3CPU              PWR_I3CPUCR1_PB8_I3CPU_Msk              /*!< Port B pin 8 I3C pull-up  */
#define PWR_I3CPUCR1_PB9_I3CPU_Pos          (7UL)
#define PWR_I3CPUCR1_PB9_I3CPU_Msk          (0x1UL << PWR_I3CPUCR1_PB9_I3CPU_Pos)   /*!< 0x00000080 */
#define PWR_I3CPUCR1_PB9_I3CPU              PWR_I3CPUCR1_PB9_I3CPU_Msk              /*!< Port B pin 9 I3C pull-up  */
#define PWR_I3CPUCR1_PB10_I3CPU_Pos         (8UL)
#define PWR_I3CPUCR1_PB10_I3CPU_Msk         (0x1UL << PWR_I3CPUCR1_PB10_I3CPU_Pos)  /*!< 0x00000100 */
#define PWR_I3CPUCR1_PB10_I3CPU             PWR_I3CPUCR1_PB10_I3CPU_Msk             /*!< Port B pin 10 I3C pull-up */
#define PWR_I3CPUCR1_PB12_I3CPU_Pos         (9UL)
#define PWR_I3CPUCR1_PB12_I3CPU_Msk         (0x1UL << PWR_I3CPUCR1_PB12_I3CPU_Pos)  /*!< 0x00000200 */
#define PWR_I3CPUCR1_PB12_I3CPU             PWR_I3CPUCR1_PB12_I3CPU_Msk             /*!< Port B pin 12 I3C pull-up */
#define PWR_I3CPUCR1_PB13_I3CPU_Pos         (10UL)
#define PWR_I3CPUCR1_PB13_I3CPU_Msk         (0x1UL << PWR_I3CPUCR1_PB13_I3CPU_Pos)  /*!< 0x00000400 */
#define PWR_I3CPUCR1_PB13_I3CPU             PWR_I3CPUCR1_PB13_I3CPU_Msk             /*!< Port B pin 13 I3C pull-up */
#define PWR_I3CPUCR1_PB14_I3CPU_Pos         (11UL)
#define PWR_I3CPUCR1_PB14_I3CPU_Msk         (0x1UL << PWR_I3CPUCR1_PB14_I3CPU_Pos)  /*!< 0x00000800 */
#define PWR_I3CPUCR1_PB14_I3CPU             PWR_I3CPUCR1_PB14_I3CPU_Msk             /*!< Port B pin 14 I3C pull-up */

/********************  Bit definition for PWR_I3CPUCR2 register  *****************/
#define PWR_I3CPUCR2_PC0_I3CPU_Pos          (0UL)
#define PWR_I3CPUCR2_PC0_I3CPU_Msk          (0x1UL << PWR_I3CPUCR2_PC0_I3CPU_Pos)   /*!< 0x00000001 */
#define PWR_I3CPUCR2_PC0_I3CPU              PWR_I3CPUCR2_PC0_I3CPU_Msk              /*!< Port C pin 0 I3C pull-up  */
#define PWR_I3CPUCR2_PC1_I3CPU_Pos          (1UL)
#define PWR_I3CPUCR2_PC1_I3CPU_Msk          (0x1UL << PWR_I3CPUCR2_PC1_I3CPU_Pos)   /*!< 0x00000002 */
#define PWR_I3CPUCR2_PC1_I3CPU              PWR_I3CPUCR2_PC1_I3CPU_Msk              /*!< Port C pin 1 I3C pull-up  */
#define PWR_I3CPUCR2_PD12_I3CPU_Pos         (3UL)
#define PWR_I3CPUCR2_PD12_I3CPU_Msk         (0x1UL << PWR_I3CPUCR2_PD12_I3CPU_Pos)  /*!< 0x00000008 */
#define PWR_I3CPUCR2_PD12_I3CPU             PWR_I3CPUCR2_PD12_I3CPU_Msk             /*!< Port D pin 12 I3C pull-up */
#define PWR_I3CPUCR2_PD13_I3CPU_Pos         (4UL)
#define PWR_I3CPUCR2_PD13_I3CPU_Msk         (0x1UL << PWR_I3CPUCR2_PD13_I3CPU_Pos)  /*!< 0x00000010 */
#define PWR_I3CPUCR2_PD13_I3CPU             PWR_I3CPUCR2_PD13_I3CPU_Msk             /*!< Port D pin 13 I3C pull-up */
#define PWR_I3CPUCR2_PG7_I3CPU_Pos          (6UL)
#define PWR_I3CPUCR2_PG7_I3CPU_Msk          (0x1UL << PWR_I3CPUCR2_PG7_I3CPU_Pos)   /*!< 0x00000040 */
#define PWR_I3CPUCR2_PG7_I3CPU              PWR_I3CPUCR2_PG7_I3CPU_Msk              /*!< Port G pin 7 I3C pull-up  */
#define PWR_I3CPUCR2_PG8_I3CPU_Pos          (7UL)
#define PWR_I3CPUCR2_PG8_I3CPU_Msk          (0x1UL << PWR_I3CPUCR2_PG8_I3CPU_Pos)   /*!< 0x00000080 */
#define PWR_I3CPUCR2_PG8_I3CPU              PWR_I3CPUCR2_PG8_I3CPU_Msk              /*!< Port G pin 8 I3C pull-up  */
#define PWR_I3CPUCR2_PG13_I3CPU_Pos         (8UL)
#define PWR_I3CPUCR2_PG13_I3CPU_Msk         (0x1UL << PWR_I3CPUCR2_PG13_I3CPU_Pos)  /*!< 0x00000100 */
#define PWR_I3CPUCR2_PG13_I3CPU             PWR_I3CPUCR2_PG13_I3CPU_Msk             /*!< Port G pin 13 I3C pull-up */
#define PWR_I3CPUCR2_PG14_I3CPU_Pos         (9UL)
#define PWR_I3CPUCR2_PG14_I3CPU_Msk         (0x1UL << PWR_I3CPUCR2_PG14_I3CPU_Pos)  /*!< 0x00000200 */
#define PWR_I3CPUCR2_PG14_I3CPU             PWR_I3CPUCR2_PG14_I3CPU_Msk             /*!< Port G pin 14 I3C pull-up */
#define PWR_I3CPUCR2_PH3_I3CPU_Pos          (11UL)
#define PWR_I3CPUCR2_PH3_I3CPU_Msk          (0x1UL << PWR_I3CPUCR2_PH3_I3CPU_Pos)   /*!< 0x00000800 */
#define PWR_I3CPUCR2_PH3_I3CPU              PWR_I3CPUCR2_PH3_I3CPU_Msk              /*!< Port H pin 3 I3C pull-up  */

/******************************************************************************/
/*                                                                            */
/*                      SRAMs configuration controller                        */
/*                                                                            */
/******************************************************************************/
/*******************  Bit definition for RAMCFG_MxCR register  ******************/
#define RAMCFG_CR_PCE_Pos                   (0UL)
#define RAMCFG_CR_PCE_Msk                   (0x1UL << RAMCFG_CR_PCE_Pos)              /*!< 0x00000001 */
#define RAMCFG_CR_PCE                       RAMCFG_CR_PCE_Msk                         /*!< Parity check Enable */
#define RAMCFG_CR_ALE_Pos                   (4UL)
#define RAMCFG_CR_ALE_Msk                   (0x1UL << RAMCFG_CR_ALE_Pos)              /*!< 0x00000010 */
#define RAMCFG_CR_ALE                       RAMCFG_CR_ALE_Msk                         /*!< Address Latching Enable */
#define RAMCFG_CR_SRAMER_Pos                (8UL)
#define RAMCFG_CR_SRAMER_Msk                (0x1UL << RAMCFG_CR_SRAMER_Pos)           /*!< 0x00000100 */
#define RAMCFG_CR_SRAMER                    RAMCFG_CR_SRAMER_Msk                      /*!< Start Erase */

/*******************  Bit definition for RAMCFG_MxIER register  ******************/
#define RAMCFG_IER_PEIE_Pos                 (1UL)
#define RAMCFG_IER_PEIE_Msk                 (0x1UL << RAMCFG_IER_PEIE_Pos)            /*!< 0x00000001 */
#define RAMCFG_IER_PEIE                     RAMCFG_IER_PEIE_Msk                       /*!< Parity error interrupt enable */
#define RAMCFG_IER_PENMI_Pos                (3UL)
#define RAMCFG_IER_PENMI_Msk                (0x1UL << RAMCFG_IER_PENMI_Pos)           /*!< 0x00000004 */
#define RAMCFG_IER_PENMI                    RAMCFG_IER_PENMI_Msk                      /*!< Parity error NMI */

