ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ST/STM32U3xx/stm32u385xx.h
/********************  Bit definition for RCC_AHB2RSTR1 register  **************/
#define RCC_AHB2RSTR1_GPIOARST_Pos          (0UL)
#define RCC_AHB2RSTR1_GPIOARST_Msk          (0x1UL << RCC_AHB2RSTR1_GPIOARST_Pos)     /*!< 0x00000001 */
#define RCC_AHB2RSTR1_GPIOARST              RCC_AHB2RSTR1_GPIOARST_Msk                /*!< IO port A Reset */
#define RCC_AHB2RSTR1_GPIOBRST_Pos          (1UL)
#define RCC_AHB2RSTR1_GPIOBRST_Msk          (0x1UL << RCC_AHB2RSTR1_GPIOBRST_Pos)     /*!< 0x00000002 */
#define RCC_AHB2RSTR1_GPIOBRST              RCC_AHB2RSTR1_GPIOBRST_Msk                /*!< IO port B Reset */
#define RCC_AHB2RSTR1_GPIOCRST_Pos          (2UL)
#define RCC_AHB2RSTR1_GPIOCRST_Msk          (0x1UL << RCC_AHB2RSTR1_GPIOCRST_Pos)     /*!< 0x00000004 */
#define RCC_AHB2RSTR1_GPIOCRST              RCC_AHB2RSTR1_GPIOCRST_Msk                /*!< IO port C Reset */
#define RCC_AHB2RSTR1_GPIODRST_Pos          (3UL)
#define RCC_AHB2RSTR1_GPIODRST_Msk          (0x1UL << RCC_AHB2RSTR1_GPIODRST_Pos)     /*!< 0x00000008 */
#define RCC_AHB2RSTR1_GPIODRST              RCC_AHB2RSTR1_GPIODRST_Msk                /*!< IO port D Reset */
#define RCC_AHB2RSTR1_GPIOERST_Pos          (4UL)
#define RCC_AHB2RSTR1_GPIOERST_Msk          (0x1UL << RCC_AHB2RSTR1_GPIOERST_Pos)     /*!< 0x00000010 */
#define RCC_AHB2RSTR1_GPIOERST              RCC_AHB2RSTR1_GPIOERST_Msk                /*!< IO port E Reset */
#define RCC_AHB2RSTR1_GPIOGRST_Pos          (6UL)
#define RCC_AHB2RSTR1_GPIOGRST_Msk          (0x1UL << RCC_AHB2RSTR1_GPIOGRST_Pos)     /*!< 0x00000040 */
#define RCC_AHB2RSTR1_GPIOGRST              RCC_AHB2RSTR1_GPIOGRST_Msk                /*!< IO port G Reset */
#define RCC_AHB2RSTR1_GPIOHRST_Pos          (7UL)
#define RCC_AHB2RSTR1_GPIOHRST_Msk          (0x1UL << RCC_AHB2RSTR1_GPIOHRST_Pos)     /*!< 0x00000080 */
#define RCC_AHB2RSTR1_GPIOHRST              RCC_AHB2RSTR1_GPIOHRST_Msk                /*!< IO port H Reset */
#define RCC_AHB2RSTR1_ADC12RST_Pos          (10UL)
#define RCC_AHB2RSTR1_ADC12RST_Msk          (0x1UL << RCC_AHB2RSTR1_ADC12RST_Pos)     /*!< 0x00000400 */
#define RCC_AHB2RSTR1_ADC12RST              RCC_AHB2RSTR1_ADC12RST_Msk                /*!< ADC12 Reset */
#define RCC_AHB2RSTR1_DAC1RST_Pos           (11UL)
#define RCC_AHB2RSTR1_DAC1RST_Msk           (0x1UL << RCC_AHB2RSTR1_DAC1RST_Pos)      /*!< 0x00000800 */
#define RCC_AHB2RSTR1_DAC1RST               RCC_AHB2RSTR1_DAC1RST_Msk                 /*!< DAC1 Reset */
#define RCC_AHB2RSTR1_AESRST_Pos            (16UL)
#define RCC_AHB2RSTR1_AESRST_Msk            (0x1UL << RCC_AHB2RSTR1_AESRST_Pos)       /*!< 0x00010000 */
#define RCC_AHB2RSTR1_AESRST                RCC_AHB2RSTR1_AESRST_Msk                  /*!< AES Reset */
#define RCC_AHB2RSTR1_HASHRST_Pos           (17UL)
#define RCC_AHB2RSTR1_HASHRST_Msk           (0x1UL << RCC_AHB2RSTR1_HASHRST_Pos)      /*!< 0x00020000 */
#define RCC_AHB2RSTR1_HASHRST               RCC_AHB2RSTR1_HASHRST_Msk                 /*!< Hash Reset */
#define RCC_AHB2RSTR1_RNGRST_Pos            (18UL)
#define RCC_AHB2RSTR1_RNGRST_Msk            (0x1UL << RCC_AHB2RSTR1_RNGRST_Pos)       /*!< 0x00040000 */
#define RCC_AHB2RSTR1_RNGRST                RCC_AHB2RSTR1_RNGRST_Msk                  /*!< RNG Reset */
#define RCC_AHB2RSTR1_PKARST_Pos            (19UL)
#define RCC_AHB2RSTR1_PKARST_Msk            (0x1UL << RCC_AHB2RSTR1_PKARST_Pos)       /*!< 0x00080000 */
#define RCC_AHB2RSTR1_PKARST                RCC_AHB2RSTR1_PKARST_Msk                  /*!< PKA reset */
#define RCC_AHB2RSTR1_SAESRST_Pos           (20UL)
#define RCC_AHB2RSTR1_SAESRST_Msk           (0x1UL << RCC_AHB2RSTR1_SAESRST_Pos)      /*!< 0x00100000 */
#define RCC_AHB2RSTR1_SAESRST               RCC_AHB2RSTR1_SAESRST_Msk                 /*!< SAES Reset */
#define RCC_AHB2RSTR1_CCBRST_Pos            (21UL)
#define RCC_AHB2RSTR1_CCBRST_Msk            (0x1UL << RCC_AHB2RSTR1_CCBRST_Pos)       /*!< 0x00200000 */
#define RCC_AHB2RSTR1_CCBRST                RCC_AHB2RSTR1_CCBRST_Msk                  /*!< CCB Reset */
#define RCC_AHB2RSTR1_SDMMC1RST_Pos         (27UL)
#define RCC_AHB2RSTR1_SDMMC1RST_Msk         (0x1UL << RCC_AHB2RSTR1_SDMMC1RST_Pos)    /*!< 0x08000000 */
#define RCC_AHB2RSTR1_SDMMC1RST             RCC_AHB2RSTR1_SDMMC1RST_Msk               /*!< SDMMC1 Reset */

/********************  Bit definition for RCC_AHB2RSTR2 register  **************/
#define RCC_AHB2RSTR2_OCTOSPI1RST_Pos       (4UL)
#define RCC_AHB2RSTR2_OCTOSPI1RST_Msk       (0x1UL << RCC_AHB2RSTR2_OCTOSPI1RST_Pos)  /*!< 0x00000010 */
#define RCC_AHB2RSTR2_OCTOSPI1RST           RCC_AHB2RSTR2_OCTOSPI1RST_Msk             /*!< OCTOSPI1 Reset */

/********************  Bit definition for RCC_APB1RSTR1 register  **************/
#define RCC_APB1RSTR1_TIM2RST_Pos           (0UL)
#define RCC_APB1RSTR1_TIM2RST_Msk           (0x1UL << RCC_APB1RSTR1_TIM2RST_Pos)      /*!< 0x00000001 */
#define RCC_APB1RSTR1_TIM2RST               RCC_APB1RSTR1_TIM2RST_Msk                 /*!< TIM2 Reset */
#define RCC_APB1RSTR1_TIM3RST_Pos           (1UL)
#define RCC_APB1RSTR1_TIM3RST_Msk           (0x1UL << RCC_APB1RSTR1_TIM3RST_Pos)      /*!< 0x00000002 */
#define RCC_APB1RSTR1_TIM3RST               RCC_APB1RSTR1_TIM3RST_Msk                 /*!< TIM3 Reset */
#define RCC_APB1RSTR1_TIM4RST_Pos           (2UL)
#define RCC_APB1RSTR1_TIM4RST_Msk           (0x1UL << RCC_APB1RSTR1_TIM4RST_Pos)      /*!< 0x00000004 */
#define RCC_APB1RSTR1_TIM4RST               RCC_APB1RSTR1_TIM4RST_Msk                 /*!< TIM4 Reset */
#define RCC_APB1RSTR1_TIM6RST_Pos           (4UL)
#define RCC_APB1RSTR1_TIM6RST_Msk           (0x1UL << RCC_APB1RSTR1_TIM6RST_Pos)      /*!< 0x00000010 */
#define RCC_APB1RSTR1_TIM6RST               RCC_APB1RSTR1_TIM6RST_Msk                 /*!< TIM6 Reset */
#define RCC_APB1RSTR1_TIM7RST_Pos           (5UL)
#define RCC_APB1RSTR1_TIM7RST_Msk           (0x1UL << RCC_APB1RSTR1_TIM7RST_Pos)      /*!< 0x00000020 */
#define RCC_APB1RSTR1_TIM7RST               RCC_APB1RSTR1_TIM7RST_Msk                 /*!< TIM7 Reset */
#define RCC_APB1RSTR1_SPI3RST_Pos           (8UL)
#define RCC_APB1RSTR1_SPI3RST_Msk           (0x1UL << RCC_APB1RSTR1_SPI3RST_Pos)      /*!< 0x00000100 */
#define RCC_APB1RSTR1_SPI3RST               RCC_APB1RSTR1_SPI3RST_Msk                 /*!< SPI3 Reset */
#define RCC_APB1RSTR1_SPI2RST_Pos           (14UL)
#define RCC_APB1RSTR1_SPI2RST_Msk           (0x1UL << RCC_APB1RSTR1_SPI2RST_Pos)      /*!< 0x00004000 */
#define RCC_APB1RSTR1_SPI2RST               RCC_APB1RSTR1_SPI2RST_Msk                 /*!< SPI2 Reset */
#define RCC_APB1RSTR1_USART3RST_Pos         (18UL)
#define RCC_APB1RSTR1_USART3RST_Msk         (0x1UL << RCC_APB1RSTR1_USART3RST_Pos)    /*!< 0x00040000 */
#define RCC_APB1RSTR1_USART3RST             RCC_APB1RSTR1_USART3RST_Msk               /*!< USART3 Reset */
#define RCC_APB1RSTR1_UART4RST_Pos          (19UL)
#define RCC_APB1RSTR1_UART4RST_Msk          (0x1UL << RCC_APB1RSTR1_UART4RST_Pos)     /*!< 0x00080000 */
#define RCC_APB1RSTR1_UART4RST              RCC_APB1RSTR1_UART4RST_Msk                /*!< UART4 Reset */
#define RCC_APB1RSTR1_UART5RST_Pos          (20UL)
#define RCC_APB1RSTR1_UART5RST_Msk          (0x1UL << RCC_APB1RSTR1_UART5RST_Pos)     /*!< 0x00100000 */
#define RCC_APB1RSTR1_UART5RST              RCC_APB1RSTR1_UART5RST_Msk                /*!< UART5 Reset */
#define RCC_APB1RSTR1_I2C1RST_Pos           (21UL)
#define RCC_APB1RSTR1_I2C1RST_Msk           (0x1UL << RCC_APB1RSTR1_I2C1RST_Pos)      /*!< 0x00200000 */
#define RCC_APB1RSTR1_I2C1RST               RCC_APB1RSTR1_I2C1RST_Msk                 /*!< I2C1 Reset */
#define RCC_APB1RSTR1_I2C2RST_Pos           (22UL)
#define RCC_APB1RSTR1_I2C2RST_Msk           (0x1UL << RCC_APB1RSTR1_I2C2RST_Pos)      /*!< 0x00400000 */
#define RCC_APB1RSTR1_I2C2RST               RCC_APB1RSTR1_I2C2RST_Msk                 /*!< I2C2 Reset */
#define RCC_APB1RSTR1_I3C1RST_Pos           (23UL)
#define RCC_APB1RSTR1_I3C1RST_Msk           (0x1UL << RCC_APB1RSTR1_I3C1RST_Pos)      /*!< 0x00800000 */
#define RCC_APB1RSTR1_I3C1RST               RCC_APB1RSTR1_I3C1RST_Msk                 /*!< I3C1 Reset */
#define RCC_APB1RSTR1_CRSRST_Pos            (24UL)
#define RCC_APB1RSTR1_CRSRST_Msk            (0x1UL << RCC_APB1RSTR1_CRSRST_Pos)       /*!< 0x01000000 */
#define RCC_APB1RSTR1_CRSRST                RCC_APB1RSTR1_CRSRST_Msk                  /*!< CRS Reset */
#define RCC_APB1RSTR1_OPAMPRST_Pos          (28UL)
#define RCC_APB1RSTR1_OPAMPRST_Msk          (0x1UL << RCC_APB1RSTR1_OPAMPRST_Pos)     /*!< 0x10000000 */
#define RCC_APB1RSTR1_OPAMPRST              RCC_APB1RSTR1_OPAMPRST_Msk                /*!< OPAMP Reset */
#define RCC_APB1RSTR1_VREFRST_Pos           (29UL)
#define RCC_APB1RSTR1_VREFRST_Msk           (0x1UL << RCC_APB1RSTR1_VREFRST_Pos)      /*!< 0x20000000 */
#define RCC_APB1RSTR1_VREFRST               RCC_APB1RSTR1_VREFRST_Msk                 /*!< VREFBUF Reset */

/********************  Bit definition for RCC_APB1RSTR2 register  **************/
#define RCC_APB1RSTR2_LPTIM2RST_Pos         (5UL)
#define RCC_APB1RSTR2_LPTIM2RST_Msk         (0x1UL << RCC_APB1RSTR2_LPTIM2RST_Pos)    /*!< 0x00000020 */
#define RCC_APB1RSTR2_LPTIM2RST             RCC_APB1RSTR2_LPTIM2RST_Msk               /*!< LPTIM2 Reset */
#define RCC_APB1RSTR2_FDCANRST_Pos          (9UL)
#define RCC_APB1RSTR2_FDCANRST_Msk          (0x1UL << RCC_APB1RSTR2_FDCANRST_Pos)     /*!< 0x00000200 */
#define RCC_APB1RSTR2_FDCANRST              RCC_APB1RSTR2_FDCANRST_Msk                /*!< FDCAN1 Reset */
#define RCC_APB1RSTR2_FDCAN1RST_Pos         RCC_APB1RSTR2_FDCANRST_Pos
#define RCC_APB1RSTR2_FDCAN1RST_Msk         RCC_APB1RSTR2_FDCANRST_Msk
#define RCC_APB1RSTR2_FDCAN1RST             RCC_APB1RSTR2_FDCANRST

/********************  Bit definition for RCC_APB2RSTR register  **************/
#define RCC_APB2RSTR_TIM1RST_Pos            (11UL)
#define RCC_APB2RSTR_TIM1RST_Msk            (0x1UL << RCC_APB2RSTR_TIM1RST_Pos)       /*!< 0x00000800 */
#define RCC_APB2RSTR_TIM1RST                RCC_APB2RSTR_TIM1RST_Msk                  /*!< TIM1 Reset */
#define RCC_APB2RSTR_SPI1RST_Pos            (12UL)
#define RCC_APB2RSTR_SPI1RST_Msk            (0x1UL << RCC_APB2RSTR_SPI1RST_Pos)       /*!< 0x00001000 */
#define RCC_APB2RSTR_SPI1RST                RCC_APB2RSTR_SPI1RST_Msk                  /*!< SPI1 Reset */
#define RCC_APB2RSTR_USART1RST_Pos          (14UL)
#define RCC_APB2RSTR_USART1RST_Msk          (0x1UL << RCC_APB2RSTR_USART1RST_Pos)     /*!< 0x00004000 */
#define RCC_APB2RSTR_USART1RST              RCC_APB2RSTR_USART1RST_Msk                /*!< USART1 Reset */
#define RCC_APB2RSTR_TIM15RST_Pos           (16UL)
#define RCC_APB2RSTR_TIM15RST_Msk           (0x1UL << RCC_APB2RSTR_TIM15RST_Pos)      /*!< 0x00010000 */
#define RCC_APB2RSTR_TIM15RST               RCC_APB2RSTR_TIM15RST_Msk                 /*!< TIM15 Reset */
#define RCC_APB2RSTR_TIM16RST_Pos           (17UL)
#define RCC_APB2RSTR_TIM16RST_Msk           (0x1UL << RCC_APB2RSTR_TIM16RST_Pos)      /*!< 0x00020000 */
#define RCC_APB2RSTR_TIM16RST               RCC_APB2RSTR_TIM16RST_Msk                 /*!< TIM16 Reset */
#define RCC_APB2RSTR_TIM17RST_Pos           (18UL)
#define RCC_APB2RSTR_TIM17RST_Msk           (0x1UL << RCC_APB2RSTR_TIM17RST_Pos)      /*!< 0x00040000 */
#define RCC_APB2RSTR_TIM17RST               RCC_APB2RSTR_TIM17RST_Msk                 /*!< TIM17 Reset */
#define RCC_APB2RSTR_SAI1RST_Pos            (21UL)
#define RCC_APB2RSTR_SAI1RST_Msk            (0x1UL << RCC_APB2RSTR_SAI1RST_Pos)       /*!< 0x00200000 */
#define RCC_APB2RSTR_SAI1RST                RCC_APB2RSTR_SAI1RST_Msk                  /*!< SAI1 Reset */
#define RCC_APB2RSTR_USB1RST_Pos            (24UL)
#define RCC_APB2RSTR_USB1RST_Msk            (0x1UL << RCC_APB2RSTR_USB1RST_Pos)       /*!< 0x01000000 */
#define RCC_APB2RSTR_USB1RST                RCC_APB2RSTR_USB1RST_Msk                  /*!< USB1 Reset */
#define RCC_APB2RSTR_I3C2RST_Pos            (27UL)
#define RCC_APB2RSTR_I3C2RST_Msk            (0x1UL << RCC_APB2RSTR_I3C2RST_Pos)       /*!< 0x08000000 */
#define RCC_APB2RSTR_I3C2RST                RCC_APB2RSTR_I3C2RST_Msk                  /*!< I3C2 Reset */

